Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief A98, Read Data and Bit Flip Register 28 */
#define MTU_MC10_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A98u)

/** \brief A9A, Read Data and Bit Flip Register 29 */
#define MTU_MC10_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Au)

/** \brief A9C, Read Data and Bit Flip Register 30 */
#define MTU_MC10_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Cu)

/** \brief A9E, Read Data and Bit Flip Register 31 */
#define MTU_MC10_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061A9Eu)

/** \brief AA0, Read Data and Bit Flip Register 32 */
#define MTU_MC10_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA0u)

/** \brief AA2, Read Data and Bit Flip Register 33 */
#define MTU_MC10_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA2u)

/** \brief AA4, Read Data and Bit Flip Register 34 */
#define MTU_MC10_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA4u)

/** \brief AA6, Read Data and Bit Flip Register 35 */
#define MTU_MC10_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA6u)

/** \brief AA8, Read Data and Bit Flip Register 36 */
#define MTU_MC10_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AA8u)

/** \brief AAA, Read Data and Bit Flip Register 37 */
#define MTU_MC10_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AAAu)

/** \brief AAC, Read Data and Bit Flip Register 38 */
#define MTU_MC10_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AACu)

/** \brief AAE, Read Data and Bit Flip Register 39 */
#define MTU_MC10_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AAEu)

/** \brief AB0, Read Data and Bit Flip Register 40 */
#define MTU_MC10_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB0u)

/** \brief AB2, Read Data and Bit Flip Register 41 */
#define MTU_MC10_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB2u)

/** \brief AB4, Read Data and Bit Flip Register 42 */
#define MTU_MC10_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB4u)

/** \brief AB6, Read Data and Bit Flip Register 43 */
#define MTU_MC10_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB6u)

/** \brief AB8, Read Data and Bit Flip Register 44 */
#define MTU_MC10_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AB8u)

/** \brief ABA, Read Data and Bit Flip Register 45 */
#define MTU_MC10_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABAu)

/** \brief ABC, Read Data and Bit Flip Register 46 */
#define MTU_MC10_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABCu)

/** \brief ABE, Read Data and Bit Flip Register 47 */
#define MTU_MC10_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ABEu)

/** \brief AC0, Read Data and Bit Flip Register 48 */
#define MTU_MC10_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC0u)

/** \brief AC2, Read Data and Bit Flip Register 49 */
#define MTU_MC10_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC2u)

/** \brief AC4, Read Data and Bit Flip Register 50 */
#define MTU_MC10_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC4u)

/** \brief AC6, Read Data and Bit Flip Register 51 */
#define MTU_MC10_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC6u)

/** \brief AC8, Read Data and Bit Flip Register 52 */
#define MTU_MC10_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AC8u)

/** \brief ACA, Read Data and Bit Flip Register 53 */
#define MTU_MC10_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ACAu)

/** \brief ACC, Read Data and Bit Flip Register 54 */
#define MTU_MC10_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ACCu)

/** \brief ACE, Read Data and Bit Flip Register 55 */
#define MTU_MC10_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ACEu)

/** \brief AD0, Read Data and Bit Flip Register 56 */
#define MTU_MC10_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD0u)

/** \brief AD2, Read Data and Bit Flip Register 57 */
#define MTU_MC10_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD2u)

/** \brief AD4, Read Data and Bit Flip Register 58 */
#define MTU_MC10_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD4u)

/** \brief AD6, Read Data and Bit Flip Register 59 */
#define MTU_MC10_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD6u)

/** \brief AD8, Read Data and Bit Flip Register 60 */
#define MTU_MC10_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AD8u)

/** \brief ADA, Read Data and Bit Flip Register 61 */
#define MTU_MC10_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ADAu)

/** \brief ADC, Read Data and Bit Flip Register 62 */
#define MTU_MC10_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ADCu)

/** \brief ADE, Read Data and Bit Flip Register 63 */
#define MTU_MC10_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ADEu)

/** \brief AE0, Read Data and Bit Flip Register 64 */
#define MTU_MC10_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AE0u)

/** \brief AE2, Read Data and Bit Flip Register 65 */
#define MTU_MC10_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AE2u)

/** \brief AE4, Read Data and Bit Flip Register 66 */
#define MTU_MC10_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061AE4u)

/** \brief AEE, Alarm Sources Configuration Register */
#define MTU_MC10_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0061AEEu)

/** \brief AF0, SSH Safety Faults Status Register  */
#define MTU_MC10_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0061AF0u)

/** \brief AF2, Error Information Register 0 */
#define MTU_MC10_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061AF2u)

