Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 2062, Read Data and Bit Flip Register 1 */
#define MTU_MC32_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063062u)

/** \brief 2064, Read Data and Bit Flip Register 2 */
#define MTU_MC32_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063064u)

/** \brief 2066, Read Data and Bit Flip Register 3 */
#define MTU_MC32_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063066u)

/** \brief 2068, Read Data and Bit Flip Register 4 */
#define MTU_MC32_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063068u)

/** \brief 206A, Read Data and Bit Flip Register 5 */
#define MTU_MC32_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006306Au)

/** \brief 206C, Read Data and Bit Flip Register 6 */
#define MTU_MC32_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006306Cu)

/** \brief 206E, Read Data and Bit Flip Register 7 */
#define MTU_MC32_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006306Eu)

/** \brief 2070, Read Data and Bit Flip Register 8 */
#define MTU_MC32_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063070u)

/** \brief 2072, Read Data and Bit Flip Register 9 */
#define MTU_MC32_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063072u)

/** \brief 2074, Read Data and Bit Flip Register 10 */
#define MTU_MC32_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063074u)

/** \brief 2076, Read Data and Bit Flip Register 11 */
#define MTU_MC32_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063076u)

/** \brief 2078, Read Data and Bit Flip Register 12 */
#define MTU_MC32_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063078u)

/** \brief 207A, Read Data and Bit Flip Register 13 */
#define MTU_MC32_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006307Au)

/** \brief 207C, Read Data and Bit Flip Register 14 */
#define MTU_MC32_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006307Cu)

/** \brief 207E, Read Data and Bit Flip Register 15 */
#define MTU_MC32_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006307Eu)

/** \brief 2080, Read Data and Bit Flip Register 16 */
#define MTU_MC32_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063080u)

/** \brief 2082, Read Data and Bit Flip Register 17 */
#define MTU_MC32_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063082u)

/** \brief 2084, Read Data and Bit Flip Register 18 */
#define MTU_MC32_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063084u)

/** \brief 2086, Read Data and Bit Flip Register 19 */
#define MTU_MC32_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063086u)

/** \brief 2088, Read Data and Bit Flip Register 20 */
#define MTU_MC32_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063088u)

/** \brief 208A, Read Data and Bit Flip Register 21 */
#define MTU_MC32_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006308Au)

/** \brief 208C, Read Data and Bit Flip Register 22 */
#define MTU_MC32_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006308Cu)

/** \brief 208E, Read Data and Bit Flip Register 23 */
#define MTU_MC32_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006308Eu)

/** \brief 2090, Read Data and Bit Flip Register 24 */
#define MTU_MC32_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063090u)

/** \brief 2092, Read Data and Bit Flip Register 25 */
#define MTU_MC32_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063092u)

/** \brief 2094, Read Data and Bit Flip Register 26 */
#define MTU_MC32_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063094u)

/** \brief 2096, Read Data and Bit Flip Register 27 */
#define MTU_MC32_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063096u)

/** \brief 2098, Read Data and Bit Flip Register 28 */
#define MTU_MC32_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063098u)

/** \brief 209A, Read Data and Bit Flip Register 29 */
#define MTU_MC32_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006309Au)

/** \brief 209C, Read Data and Bit Flip Register 30 */
#define MTU_MC32_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006309Cu)

/** \brief 209E, Read Data and Bit Flip Register 31 */
#define MTU_MC32_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006309Eu)

/** \brief 20A0, Read Data and Bit Flip Register 32 */
#define MTU_MC32_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A0u)

/** \brief 20A2, Read Data and Bit Flip Register 33 */
#define MTU_MC32_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A2u)

/** \brief 20A4, Read Data and Bit Flip Register 34 */
#define MTU_MC32_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A4u)

/** \brief 20A6, Read Data and Bit Flip Register 35 */
#define MTU_MC32_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A6u)

/** \brief 20A8, Read Data and Bit Flip Register 36 */
#define MTU_MC32_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630A8u)

/** \brief 20AA, Read Data and Bit Flip Register 37 */
#define MTU_MC32_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630AAu)

/** \brief 20AC, Read Data and Bit Flip Register 38 */
#define MTU_MC32_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630ACu)

/** \brief 20AE, Read Data and Bit Flip Register 39 */
#define MTU_MC32_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630AEu)

/** \brief 20B0, Read Data and Bit Flip Register 40 */
#define MTU_MC32_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B0u)

/** \brief 20B2, Read Data and Bit Flip Register 41 */
#define MTU_MC32_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00630B2u)

