Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 2CC8, Read Data and Bit Flip Register 52 */
#define MTU_MC44_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CC8u)

/** \brief 2CCA, Read Data and Bit Flip Register 53 */
#define MTU_MC44_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CCAu)

/** \brief 2CCC, Read Data and Bit Flip Register 54 */
#define MTU_MC44_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CCCu)

/** \brief 2CCE, Read Data and Bit Flip Register 55 */
#define MTU_MC44_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CCEu)

/** \brief 2CD0, Read Data and Bit Flip Register 56 */
#define MTU_MC44_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD0u)

/** \brief 2CD2, Read Data and Bit Flip Register 57 */
#define MTU_MC44_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD2u)

/** \brief 2CD4, Read Data and Bit Flip Register 58 */
#define MTU_MC44_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD4u)

/** \brief 2CD6, Read Data and Bit Flip Register 59 */
#define MTU_MC44_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD6u)

/** \brief 2CD8, Read Data and Bit Flip Register 60 */
#define MTU_MC44_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CD8u)

/** \brief 2CDA, Read Data and Bit Flip Register 61 */
#define MTU_MC44_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CDAu)

/** \brief 2CDC, Read Data and Bit Flip Register 62 */
#define MTU_MC44_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CDCu)

/** \brief 2CDE, Read Data and Bit Flip Register 63 */
#define MTU_MC44_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CDEu)

/** \brief 2CE0, Read Data and Bit Flip Register 64 */
#define MTU_MC44_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CE0u)

/** \brief 2CE2, Read Data and Bit Flip Register 65 */
#define MTU_MC44_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CE2u)

/** \brief 2CE4, Read Data and Bit Flip Register 66 */
#define MTU_MC44_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063CE4u)

/** \brief 2CEE, Alarm Sources Configuration Register */
#define MTU_MC44_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0063CEEu)

/** \brief 2CF0, SSH Safety Faults Status Register  */
#define MTU_MC44_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0063CF0u)

/** \brief 2CF2, Error Information Register 0 */
#define MTU_MC44_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF2u)

/** \brief 2CF4, Error Information Register 1 */
#define MTU_MC44_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF4u)

/** \brief 2CF6, Error Information Register 2 */
#define MTU_MC44_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF6u)

/** \brief 2CF8, Error Information Register 3 */
#define MTU_MC44_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CF8u)

/** \brief 2CFA, Error Information Register 4 */
#define MTU_MC44_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063CFAu)

/** \brief 2D00, Configuration Registers */
#define MTU_MC45_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063D00u)

/** \brief 2D02, Configuration Register 1 */
#define MTU_MC45_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063D02u)

/** \brief 2D04, MBIST Control Register */
#define MTU_MC45_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063D04u)

/** \brief 2D06, Status Register */
#define MTU_MC45_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063D06u)

/** \brief 2D08, Range Register, single address mode */
#define MTU_MC45_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063D08u)

/** \brief 2D0C, Revision ID Register */
#define MTU_MC45_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063D0Cu)

/** \brief 2D0E, ECC Safety Register */
#define MTU_MC45_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063D0Eu)

/** \brief 2D10, Memory ECC Detection Register */
#define MTU_MC45_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063D10u)

/** \brief 2D12, Error Tracking Register 0 */
#define MTU_MC45_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D12u)

/** \brief 2D14, Error Tracking Register 1 */
#define MTU_MC45_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D14u)

/** \brief 2D16, Error Tracking Register 2 */
#define MTU_MC45_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D16u)

/** \brief 2D18, Error Tracking Register 3 */
#define MTU_MC45_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D18u)

/** \brief 2D1A, Error Tracking Register 4 */
#define MTU_MC45_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063D1Au)

/** \brief 2D60, Read Data and Bit Flip Register 0 */
#define MTU_MC45_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D60u)

/** \brief 2D62, Read Data and Bit Flip Register 1 */
#define MTU_MC45_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D62u)

/** \brief 2D64, Read Data and Bit Flip Register 2 */
#define MTU_MC45_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D64u)

/** \brief 2D66, Read Data and Bit Flip Register 3 */
#define MTU_MC45_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D66u)

/** \brief 2D68, Read Data and Bit Flip Register 4 */
#define MTU_MC45_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D68u)

/** \brief 2D6A, Read Data and Bit Flip Register 5 */
#define MTU_MC45_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D6Au)

/** \brief 2D6C, Read Data and Bit Flip Register 6 */
#define MTU_MC45_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D6Cu)

/** \brief 2D6E, Read Data and Bit Flip Register 7 */
#define MTU_MC45_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063D6Eu)

