Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 2F72, Read Data and Bit Flip Register 9 */
#define MTU_MC47_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F72u)

/** \brief 2F74, Read Data and Bit Flip Register 10 */
#define MTU_MC47_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F74u)

/** \brief 2F76, Read Data and Bit Flip Register 11 */
#define MTU_MC47_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F76u)

/** \brief 2F78, Read Data and Bit Flip Register 12 */
#define MTU_MC47_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F78u)

/** \brief 2F7A, Read Data and Bit Flip Register 13 */
#define MTU_MC47_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F7Au)

/** \brief 2F7C, Read Data and Bit Flip Register 14 */
#define MTU_MC47_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F7Cu)

/** \brief 2F7E, Read Data and Bit Flip Register 15 */
#define MTU_MC47_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F7Eu)

/** \brief 2F80, Read Data and Bit Flip Register 16 */
#define MTU_MC47_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F80u)

/** \brief 2F82, Read Data and Bit Flip Register 17 */
#define MTU_MC47_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F82u)

/** \brief 2F84, Read Data and Bit Flip Register 18 */
#define MTU_MC47_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F84u)

/** \brief 2F86, Read Data and Bit Flip Register 19 */
#define MTU_MC47_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F86u)

/** \brief 2F88, Read Data and Bit Flip Register 20 */
#define MTU_MC47_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F88u)

/** \brief 2F8A, Read Data and Bit Flip Register 21 */
#define MTU_MC47_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F8Au)

/** \brief 2F8C, Read Data and Bit Flip Register 22 */
#define MTU_MC47_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F8Cu)

/** \brief 2F8E, Read Data and Bit Flip Register 23 */
#define MTU_MC47_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F8Eu)

/** \brief 2F90, Read Data and Bit Flip Register 24 */
#define MTU_MC47_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F90u)

/** \brief 2F92, Read Data and Bit Flip Register 25 */
#define MTU_MC47_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F92u)

/** \brief 2F94, Read Data and Bit Flip Register 26 */
#define MTU_MC47_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F94u)

/** \brief 2F96, Read Data and Bit Flip Register 27 */
#define MTU_MC47_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F96u)

/** \brief 2F98, Read Data and Bit Flip Register 28 */
#define MTU_MC47_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F98u)

/** \brief 2F9A, Read Data and Bit Flip Register 29 */
#define MTU_MC47_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F9Au)

/** \brief 2F9C, Read Data and Bit Flip Register 30 */
#define MTU_MC47_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F9Cu)

/** \brief 2F9E, Read Data and Bit Flip Register 31 */
#define MTU_MC47_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F9Eu)

/** \brief 2FA0, Read Data and Bit Flip Register 32 */
#define MTU_MC47_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA0u)

/** \brief 2FA2, Read Data and Bit Flip Register 33 */
#define MTU_MC47_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA2u)

/** \brief 2FA4, Read Data and Bit Flip Register 34 */
#define MTU_MC47_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA4u)

/** \brief 2FA6, Read Data and Bit Flip Register 35 */
#define MTU_MC47_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA6u)

/** \brief 2FA8, Read Data and Bit Flip Register 36 */
#define MTU_MC47_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FA8u)

/** \brief 2FAA, Read Data and Bit Flip Register 37 */
#define MTU_MC47_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FAAu)

/** \brief 2FAC, Read Data and Bit Flip Register 38 */
#define MTU_MC47_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FACu)

/** \brief 2FAE, Read Data and Bit Flip Register 39 */
#define MTU_MC47_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FAEu)

/** \brief 2FB0, Read Data and Bit Flip Register 40 */
#define MTU_MC47_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB0u)

/** \brief 2FB2, Read Data and Bit Flip Register 41 */
#define MTU_MC47_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB2u)

/** \brief 2FB4, Read Data and Bit Flip Register 42 */
#define MTU_MC47_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB4u)

/** \brief 2FB6, Read Data and Bit Flip Register 43 */
#define MTU_MC47_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB6u)

/** \brief 2FB8, Read Data and Bit Flip Register 44 */
#define MTU_MC47_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FB8u)

/** \brief 2FBA, Read Data and Bit Flip Register 45 */
#define MTU_MC47_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FBAu)

/** \brief 2FBC, Read Data and Bit Flip Register 46 */
#define MTU_MC47_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FBCu)

/** \brief 2FBE, Read Data and Bit Flip Register 47 */
#define MTU_MC47_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FBEu)

/** \brief 2FC0, Read Data and Bit Flip Register 48 */
#define MTU_MC47_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC0u)

/** \brief 2FC2, Read Data and Bit Flip Register 49 */
#define MTU_MC47_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC2u)

/** \brief 2FC4, Read Data and Bit Flip Register 50 */
#define MTU_MC47_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063FC4u)

