Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 337C, Read Data and Bit Flip Register 14 */
#define MTU_MC51_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006437Cu)

/** \brief 337E, Read Data and Bit Flip Register 15 */
#define MTU_MC51_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006437Eu)

/** \brief 3380, Read Data and Bit Flip Register 16 */
#define MTU_MC51_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064380u)

/** \brief 3382, Read Data and Bit Flip Register 17 */
#define MTU_MC51_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064382u)

/** \brief 3384, Read Data and Bit Flip Register 18 */
#define MTU_MC51_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064384u)

/** \brief 3386, Read Data and Bit Flip Register 19 */
#define MTU_MC51_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064386u)

/** \brief 3388, Read Data and Bit Flip Register 20 */
#define MTU_MC51_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064388u)

/** \brief 338A, Read Data and Bit Flip Register 21 */
#define MTU_MC51_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006438Au)

/** \brief 338C, Read Data and Bit Flip Register 22 */
#define MTU_MC51_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006438Cu)

/** \brief 338E, Read Data and Bit Flip Register 23 */
#define MTU_MC51_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006438Eu)

/** \brief 3390, Read Data and Bit Flip Register 24 */
#define MTU_MC51_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064390u)

/** \brief 3392, Read Data and Bit Flip Register 25 */
#define MTU_MC51_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064392u)

/** \brief 3394, Read Data and Bit Flip Register 26 */
#define MTU_MC51_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064394u)

/** \brief 3396, Read Data and Bit Flip Register 27 */
#define MTU_MC51_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064396u)

/** \brief 3398, Read Data and Bit Flip Register 28 */
#define MTU_MC51_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064398u)

/** \brief 339A, Read Data and Bit Flip Register 29 */
#define MTU_MC51_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006439Au)

/** \brief 339C, Read Data and Bit Flip Register 30 */
#define MTU_MC51_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006439Cu)

/** \brief 339E, Read Data and Bit Flip Register 31 */
#define MTU_MC51_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006439Eu)

/** \brief 33A0, Read Data and Bit Flip Register 32 */
#define MTU_MC51_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A0u)

/** \brief 33A2, Read Data and Bit Flip Register 33 */
#define MTU_MC51_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A2u)

/** \brief 33A4, Read Data and Bit Flip Register 34 */
#define MTU_MC51_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A4u)

/** \brief 33A6, Read Data and Bit Flip Register 35 */
#define MTU_MC51_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A6u)

/** \brief 33A8, Read Data and Bit Flip Register 36 */
#define MTU_MC51_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643A8u)

/** \brief 33AA, Read Data and Bit Flip Register 37 */
#define MTU_MC51_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643AAu)

/** \brief 33AC, Read Data and Bit Flip Register 38 */
#define MTU_MC51_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643ACu)

/** \brief 33AE, Read Data and Bit Flip Register 39 */
#define MTU_MC51_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643AEu)

/** \brief 33B0, Read Data and Bit Flip Register 40 */
#define MTU_MC51_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B0u)

/** \brief 33B2, Read Data and Bit Flip Register 41 */
#define MTU_MC51_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B2u)

/** \brief 33B4, Read Data and Bit Flip Register 42 */
#define MTU_MC51_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B4u)

/** \brief 33B6, Read Data and Bit Flip Register 43 */
#define MTU_MC51_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B6u)

/** \brief 33B8, Read Data and Bit Flip Register 44 */
#define MTU_MC51_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643B8u)

/** \brief 33BA, Read Data and Bit Flip Register 45 */
#define MTU_MC51_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643BAu)

/** \brief 33BC, Read Data and Bit Flip Register 46 */
#define MTU_MC51_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643BCu)

/** \brief 33BE, Read Data and Bit Flip Register 47 */
#define MTU_MC51_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643BEu)

/** \brief 33C0, Read Data and Bit Flip Register 48 */
#define MTU_MC51_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C0u)

/** \brief 33C2, Read Data and Bit Flip Register 49 */
#define MTU_MC51_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C2u)

/** \brief 33C4, Read Data and Bit Flip Register 50 */
#define MTU_MC51_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C4u)

/** \brief 33C6, Read Data and Bit Flip Register 51 */
#define MTU_MC51_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C6u)

/** \brief 33C8, Read Data and Bit Flip Register 52 */
#define MTU_MC51_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643C8u)

/** \brief 33CA, Read Data and Bit Flip Register 53 */
#define MTU_MC51_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643CAu)

/** \brief 33CC, Read Data and Bit Flip Register 54 */
#define MTU_MC51_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643CCu)

/** \brief 33CE, Read Data and Bit Flip Register 55 */
#define MTU_MC51_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643CEu)

/** \brief 33D0, Read Data and Bit Flip Register 56 */
#define MTU_MC51_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D0u)

/** \brief 33D2, Read Data and Bit Flip Register 57 */
#define MTU_MC51_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D2u)

/** \brief 33D4, Read Data and Bit Flip Register 58 */
#define MTU_MC51_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D4u)

/** \brief 33D6, Read Data and Bit Flip Register 59 */
#define MTU_MC51_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D6u)

/** \brief 33D8, Read Data and Bit Flip Register 60 */
#define MTU_MC51_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643D8u)

/** \brief 33DA, Read Data and Bit Flip Register 61 */
#define MTU_MC51_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643DAu)

/** \brief 33DC, Read Data and Bit Flip Register 62 */
#define MTU_MC51_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643DCu)

/** \brief 33DE, Read Data and Bit Flip Register 63 */
#define MTU_MC51_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643DEu)

/** \brief 33E0, Read Data and Bit Flip Register 64 */
#define MTU_MC51_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643E0u)

/** \brief 33E2, Read Data and Bit Flip Register 65 */
#define MTU_MC51_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643E2u)

/** \brief 33E4, Read Data and Bit Flip Register 66 */
#define MTU_MC51_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00643E4u)

/** \brief 33EE, Alarm Sources Configuration Register */
#define MTU_MC51_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00643EEu)

/** \brief 33F0, SSH Safety Faults Status Register  */
#define MTU_MC51_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00643F0u)

/** \brief 33F2, Error Information Register 0 */
#define MTU_MC51_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00643F2u)

