Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 3592, Read Data and Bit Flip Register 25 */
#define MTU_MC53_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064592u)

/** \brief 3594, Read Data and Bit Flip Register 26 */
#define MTU_MC53_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064594u)

/** \brief 3596, Read Data and Bit Flip Register 27 */
#define MTU_MC53_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064596u)

/** \brief 3598, Read Data and Bit Flip Register 28 */
#define MTU_MC53_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064598u)

/** \brief 359A, Read Data and Bit Flip Register 29 */
#define MTU_MC53_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006459Au)

/** \brief 359C, Read Data and Bit Flip Register 30 */
#define MTU_MC53_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006459Cu)

/** \brief 359E, Read Data and Bit Flip Register 31 */
#define MTU_MC53_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006459Eu)

/** \brief 35A0, Read Data and Bit Flip Register 32 */
#define MTU_MC53_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A0u)

/** \brief 35A2, Read Data and Bit Flip Register 33 */
#define MTU_MC53_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A2u)

/** \brief 35A4, Read Data and Bit Flip Register 34 */
#define MTU_MC53_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A4u)

/** \brief 35A6, Read Data and Bit Flip Register 35 */
#define MTU_MC53_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A6u)

/** \brief 35A8, Read Data and Bit Flip Register 36 */
#define MTU_MC53_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645A8u)

/** \brief 35AA, Read Data and Bit Flip Register 37 */
#define MTU_MC53_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645AAu)

/** \brief 35AC, Read Data and Bit Flip Register 38 */
#define MTU_MC53_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645ACu)

/** \brief 35AE, Read Data and Bit Flip Register 39 */
#define MTU_MC53_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645AEu)

/** \brief 35B0, Read Data and Bit Flip Register 40 */
#define MTU_MC53_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B0u)

/** \brief 35B2, Read Data and Bit Flip Register 41 */
#define MTU_MC53_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B2u)

/** \brief 35B4, Read Data and Bit Flip Register 42 */
#define MTU_MC53_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B4u)

/** \brief 35B6, Read Data and Bit Flip Register 43 */
#define MTU_MC53_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B6u)

/** \brief 35B8, Read Data and Bit Flip Register 44 */
#define MTU_MC53_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645B8u)

/** \brief 35BA, Read Data and Bit Flip Register 45 */
#define MTU_MC53_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645BAu)

/** \brief 35BC, Read Data and Bit Flip Register 46 */
#define MTU_MC53_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645BCu)

/** \brief 35BE, Read Data and Bit Flip Register 47 */
#define MTU_MC53_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645BEu)

/** \brief 35C0, Read Data and Bit Flip Register 48 */
#define MTU_MC53_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C0u)

/** \brief 35C2, Read Data and Bit Flip Register 49 */
#define MTU_MC53_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C2u)

/** \brief 35C4, Read Data and Bit Flip Register 50 */
#define MTU_MC53_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C4u)

/** \brief 35C6, Read Data and Bit Flip Register 51 */
#define MTU_MC53_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C6u)

/** \brief 35C8, Read Data and Bit Flip Register 52 */
#define MTU_MC53_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645C8u)

/** \brief 35CA, Read Data and Bit Flip Register 53 */
#define MTU_MC53_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645CAu)

/** \brief 35CC, Read Data and Bit Flip Register 54 */
#define MTU_MC53_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645CCu)

/** \brief 35CE, Read Data and Bit Flip Register 55 */
#define MTU_MC53_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645CEu)

/** \brief 35D0, Read Data and Bit Flip Register 56 */
#define MTU_MC53_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D0u)

/** \brief 35D2, Read Data and Bit Flip Register 57 */
#define MTU_MC53_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D2u)

/** \brief 35D4, Read Data and Bit Flip Register 58 */
#define MTU_MC53_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D4u)

/** \brief 35D6, Read Data and Bit Flip Register 59 */
#define MTU_MC53_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D6u)

/** \brief 35D8, Read Data and Bit Flip Register 60 */
#define MTU_MC53_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645D8u)

/** \brief 35DA, Read Data and Bit Flip Register 61 */
#define MTU_MC53_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645DAu)

/** \brief 35DC, Read Data and Bit Flip Register 62 */
#define MTU_MC53_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645DCu)

/** \brief 35DE, Read Data and Bit Flip Register 63 */
#define MTU_MC53_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645DEu)

/** \brief 35E0, Read Data and Bit Flip Register 64 */
#define MTU_MC53_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645E0u)

/** \brief 35E2, Read Data and Bit Flip Register 65 */
#define MTU_MC53_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645E2u)

/** \brief 35E4, Read Data and Bit Flip Register 66 */
#define MTU_MC53_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00645E4u)

/** \brief 35EE, Alarm Sources Configuration Register */
#define MTU_MC53_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00645EEu)

