Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 3ACC, Read Data and Bit Flip Register 54 */
#define MTU_MC58_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ACCu)

/** \brief 3ACE, Read Data and Bit Flip Register 55 */
#define MTU_MC58_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ACEu)

/** \brief 3AD0, Read Data and Bit Flip Register 56 */
#define MTU_MC58_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD0u)

/** \brief 3AD2, Read Data and Bit Flip Register 57 */
#define MTU_MC58_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD2u)

/** \brief 3AD4, Read Data and Bit Flip Register 58 */
#define MTU_MC58_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD4u)

/** \brief 3AD6, Read Data and Bit Flip Register 59 */
#define MTU_MC58_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD6u)

/** \brief 3AD8, Read Data and Bit Flip Register 60 */
#define MTU_MC58_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AD8u)

/** \brief 3ADA, Read Data and Bit Flip Register 61 */
#define MTU_MC58_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ADAu)

/** \brief 3ADC, Read Data and Bit Flip Register 62 */
#define MTU_MC58_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ADCu)

/** \brief 3ADE, Read Data and Bit Flip Register 63 */
#define MTU_MC58_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064ADEu)

/** \brief 3AE0, Read Data and Bit Flip Register 64 */
#define MTU_MC58_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AE0u)

/** \brief 3AE2, Read Data and Bit Flip Register 65 */
#define MTU_MC58_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AE2u)

/** \brief 3AE4, Read Data and Bit Flip Register 66 */
#define MTU_MC58_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064AE4u)

/** \brief 3AEE, Alarm Sources Configuration Register */
#define MTU_MC58_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0064AEEu)

/** \brief 3AF0, SSH Safety Faults Status Register  */
#define MTU_MC58_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0064AF0u)

/** \brief 3AF2, Error Information Register 0 */
#define MTU_MC58_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF2u)

/** \brief 3AF4, Error Information Register 1 */
#define MTU_MC58_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF4u)

/** \brief 3AF6, Error Information Register 2 */
#define MTU_MC58_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF6u)

/** \brief 3AF8, Error Information Register 3 */
#define MTU_MC58_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AF8u)

/** \brief 3AFA, Error Information Register 4 */
#define MTU_MC58_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0064AFAu)

/** \brief 3B00, Configuration Registers */
#define MTU_MC59_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064B00u)

/** \brief 3B02, Configuration Register 1 */
#define MTU_MC59_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064B02u)

/** \brief 3B04, MBIST Control Register */
#define MTU_MC59_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064B04u)

/** \brief 3B06, Status Register */
#define MTU_MC59_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064B06u)

/** \brief 3B08, Range Register, single address mode */
#define MTU_MC59_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064B08u)

/** \brief 3B0C, Revision ID Register */
#define MTU_MC59_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0064B0Cu)

/** \brief 3B0E, ECC Safety Register */
#define MTU_MC59_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0064B0Eu)

/** \brief 3B10, Memory ECC Detection Register */
#define MTU_MC59_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064B10u)

/** \brief 3B12, Error Tracking Register 0 */
#define MTU_MC59_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B12u)

/** \brief 3B14, Error Tracking Register 1 */
#define MTU_MC59_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B14u)

/** \brief 3B16, Error Tracking Register 2 */
#define MTU_MC59_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B16u)

/** \brief 3B18, Error Tracking Register 3 */
#define MTU_MC59_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B18u)

/** \brief 3B1A, Error Tracking Register 4 */
#define MTU_MC59_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064B1Au)

/** \brief 3B60, Read Data and Bit Flip Register 0 */
#define MTU_MC59_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B60u)

/** \brief 3B62, Read Data and Bit Flip Register 1 */
#define MTU_MC59_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B62u)

/** \brief 3B64, Read Data and Bit Flip Register 2 */
#define MTU_MC59_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B64u)

/** \brief 3B66, Read Data and Bit Flip Register 3 */
#define MTU_MC59_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B66u)

/** \brief 3B68, Read Data and Bit Flip Register 4 */
#define MTU_MC59_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B68u)

/** \brief 3B6A, Read Data and Bit Flip Register 5 */
#define MTU_MC59_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B6Au)

/** \brief 3B6C, Read Data and Bit Flip Register 6 */
#define MTU_MC59_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B6Cu)

/** \brief 3B6E, Read Data and Bit Flip Register 7 */
#define MTU_MC59_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B6Eu)

/** \brief 3B70, Read Data and Bit Flip Register 8 */
#define MTU_MC59_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064B70u)

