Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 4462, Read Data and Bit Flip Register 1 */
#define MTU_MC68_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065462u)

/** \brief 4464, Read Data and Bit Flip Register 2 */
#define MTU_MC68_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065464u)

/** \brief 4466, Read Data and Bit Flip Register 3 */
#define MTU_MC68_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065466u)

/** \brief 4468, Read Data and Bit Flip Register 4 */
#define MTU_MC68_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065468u)

/** \brief 446A, Read Data and Bit Flip Register 5 */
#define MTU_MC68_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006546Au)

/** \brief 446C, Read Data and Bit Flip Register 6 */
#define MTU_MC68_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006546Cu)

/** \brief 446E, Read Data and Bit Flip Register 7 */
#define MTU_MC68_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006546Eu)

/** \brief 4470, Read Data and Bit Flip Register 8 */
#define MTU_MC68_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065470u)

/** \brief 4472, Read Data and Bit Flip Register 9 */
#define MTU_MC68_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065472u)

/** \brief 4474, Read Data and Bit Flip Register 10 */
#define MTU_MC68_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065474u)

/** \brief 4476, Read Data and Bit Flip Register 11 */
#define MTU_MC68_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065476u)

/** \brief 4478, Read Data and Bit Flip Register 12 */
#define MTU_MC68_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065478u)

/** \brief 447A, Read Data and Bit Flip Register 13 */
#define MTU_MC68_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006547Au)

/** \brief 447C, Read Data and Bit Flip Register 14 */
#define MTU_MC68_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006547Cu)

/** \brief 447E, Read Data and Bit Flip Register 15 */
#define MTU_MC68_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006547Eu)

/** \brief 4480, Read Data and Bit Flip Register 16 */
#define MTU_MC68_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065480u)

/** \brief 4482, Read Data and Bit Flip Register 17 */
#define MTU_MC68_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065482u)

/** \brief 4484, Read Data and Bit Flip Register 18 */
#define MTU_MC68_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065484u)

/** \brief 4486, Read Data and Bit Flip Register 19 */
#define MTU_MC68_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065486u)

/** \brief 4488, Read Data and Bit Flip Register 20 */
#define MTU_MC68_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065488u)

/** \brief 448A, Read Data and Bit Flip Register 21 */
#define MTU_MC68_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006548Au)

/** \brief 448C, Read Data and Bit Flip Register 22 */
#define MTU_MC68_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006548Cu)

/** \brief 448E, Read Data and Bit Flip Register 23 */
#define MTU_MC68_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006548Eu)

/** \brief 4490, Read Data and Bit Flip Register 24 */
#define MTU_MC68_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065490u)

/** \brief 4492, Read Data and Bit Flip Register 25 */
#define MTU_MC68_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065492u)

/** \brief 4494, Read Data and Bit Flip Register 26 */
#define MTU_MC68_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065494u)

/** \brief 4496, Read Data and Bit Flip Register 27 */
#define MTU_MC68_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065496u)

/** \brief 4498, Read Data and Bit Flip Register 28 */
#define MTU_MC68_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065498u)

/** \brief 449A, Read Data and Bit Flip Register 29 */
#define MTU_MC68_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006549Au)

/** \brief 449C, Read Data and Bit Flip Register 30 */
#define MTU_MC68_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006549Cu)

/** \brief 449E, Read Data and Bit Flip Register 31 */
#define MTU_MC68_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006549Eu)

/** \brief 44A0, Read Data and Bit Flip Register 32 */
#define MTU_MC68_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A0u)

/** \brief 44A2, Read Data and Bit Flip Register 33 */
#define MTU_MC68_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A2u)

/** \brief 44A4, Read Data and Bit Flip Register 34 */
#define MTU_MC68_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A4u)

/** \brief 44A6, Read Data and Bit Flip Register 35 */
#define MTU_MC68_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A6u)

/** \brief 44A8, Read Data and Bit Flip Register 36 */
#define MTU_MC68_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654A8u)

/** \brief 44AA, Read Data and Bit Flip Register 37 */
#define MTU_MC68_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654AAu)

/** \brief 44AC, Read Data and Bit Flip Register 38 */
#define MTU_MC68_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654ACu)

/** \brief 44AE, Read Data and Bit Flip Register 39 */
#define MTU_MC68_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654AEu)

/** \brief 44B0, Read Data and Bit Flip Register 40 */
#define MTU_MC68_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654B0u)

/** \brief 44B2, Read Data and Bit Flip Register 41 */
#define MTU_MC68_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00654B2u)

