Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 4714, Error Tracking Register 1 */
#define MTU_MC71_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065714u)

/** \brief 4716, Error Tracking Register 2 */
#define MTU_MC71_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065716u)

/** \brief 4718, Error Tracking Register 3 */
#define MTU_MC71_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065718u)

/** \brief 471A, Error Tracking Register 4 */
#define MTU_MC71_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006571Au)

/** \brief 4760, Read Data and Bit Flip Register 0 */
#define MTU_MC71_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065760u)

/** \brief 4762, Read Data and Bit Flip Register 1 */
#define MTU_MC71_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065762u)

/** \brief 4764, Read Data and Bit Flip Register 2 */
#define MTU_MC71_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065764u)

/** \brief 4766, Read Data and Bit Flip Register 3 */
#define MTU_MC71_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065766u)

/** \brief 4768, Read Data and Bit Flip Register 4 */
#define MTU_MC71_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065768u)

/** \brief 476A, Read Data and Bit Flip Register 5 */
#define MTU_MC71_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006576Au)

/** \brief 476C, Read Data and Bit Flip Register 6 */
#define MTU_MC71_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006576Cu)

/** \brief 476E, Read Data and Bit Flip Register 7 */
#define MTU_MC71_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006576Eu)

/** \brief 4770, Read Data and Bit Flip Register 8 */
#define MTU_MC71_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065770u)

/** \brief 4772, Read Data and Bit Flip Register 9 */
#define MTU_MC71_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065772u)

/** \brief 4774, Read Data and Bit Flip Register 10 */
#define MTU_MC71_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065774u)

/** \brief 4776, Read Data and Bit Flip Register 11 */
#define MTU_MC71_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065776u)

/** \brief 4778, Read Data and Bit Flip Register 12 */
#define MTU_MC71_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065778u)

/** \brief 477A, Read Data and Bit Flip Register 13 */
#define MTU_MC71_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006577Au)

/** \brief 477C, Read Data and Bit Flip Register 14 */
#define MTU_MC71_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006577Cu)

/** \brief 477E, Read Data and Bit Flip Register 15 */
#define MTU_MC71_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006577Eu)

/** \brief 4780, Read Data and Bit Flip Register 16 */
#define MTU_MC71_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065780u)

/** \brief 4782, Read Data and Bit Flip Register 17 */
#define MTU_MC71_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065782u)

/** \brief 4784, Read Data and Bit Flip Register 18 */
#define MTU_MC71_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065784u)

/** \brief 4786, Read Data and Bit Flip Register 19 */
#define MTU_MC71_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065786u)

/** \brief 4788, Read Data and Bit Flip Register 20 */
#define MTU_MC71_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065788u)

/** \brief 478A, Read Data and Bit Flip Register 21 */
#define MTU_MC71_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006578Au)

/** \brief 478C, Read Data and Bit Flip Register 22 */
#define MTU_MC71_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006578Cu)

/** \brief 478E, Read Data and Bit Flip Register 23 */
#define MTU_MC71_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006578Eu)

/** \brief 4790, Read Data and Bit Flip Register 24 */
#define MTU_MC71_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065790u)

/** \brief 4792, Read Data and Bit Flip Register 25 */
#define MTU_MC71_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065792u)

/** \brief 4794, Read Data and Bit Flip Register 26 */
#define MTU_MC71_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065794u)

/** \brief 4796, Read Data and Bit Flip Register 27 */
#define MTU_MC71_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065796u)

/** \brief 4798, Read Data and Bit Flip Register 28 */
#define MTU_MC71_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065798u)

/** \brief 479A, Read Data and Bit Flip Register 29 */
#define MTU_MC71_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006579Au)

/** \brief 479C, Read Data and Bit Flip Register 30 */
#define MTU_MC71_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006579Cu)

/** \brief 479E, Read Data and Bit Flip Register 31 */
#define MTU_MC71_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006579Eu)

/** \brief 47A0, Read Data and Bit Flip Register 32 */
#define MTU_MC71_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A0u)

/** \brief 47A2, Read Data and Bit Flip Register 33 */
#define MTU_MC71_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A2u)

/** \brief 47A4, Read Data and Bit Flip Register 34 */
#define MTU_MC71_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A4u)

/** \brief 47A6, Read Data and Bit Flip Register 35 */
#define MTU_MC71_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A6u)

/** \brief 47A8, Read Data and Bit Flip Register 36 */
#define MTU_MC71_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657A8u)

/** \brief 47AA, Read Data and Bit Flip Register 37 */
#define MTU_MC71_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657AAu)

/** \brief 47AC, Read Data and Bit Flip Register 38 */
#define MTU_MC71_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657ACu)

/** \brief 47AE, Read Data and Bit Flip Register 39 */
#define MTU_MC71_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657AEu)

/** \brief 47B0, Read Data and Bit Flip Register 40 */
#define MTU_MC71_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B0u)

/** \brief 47B2, Read Data and Bit Flip Register 41 */
#define MTU_MC71_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B2u)

/** \brief 47B4, Read Data and Bit Flip Register 42 */
#define MTU_MC71_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B4u)

/** \brief 47B6, Read Data and Bit Flip Register 43 */
#define MTU_MC71_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B6u)

/** \brief 47B8, Read Data and Bit Flip Register 44 */
#define MTU_MC71_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657B8u)

/** \brief 47BA, Read Data and Bit Flip Register 45 */
#define MTU_MC71_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657BAu)

/** \brief 47BC, Read Data and Bit Flip Register 46 */
#define MTU_MC71_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657BCu)

/** \brief 47BE, Read Data and Bit Flip Register 47 */
#define MTU_MC71_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657BEu)

/** \brief 47C0, Read Data and Bit Flip Register 48 */
#define MTU_MC71_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C0u)

/** \brief 47C2, Read Data and Bit Flip Register 49 */
#define MTU_MC71_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C2u)

/** \brief 47C4, Read Data and Bit Flip Register 50 */
#define MTU_MC71_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C4u)

/** \brief 47C6, Read Data and Bit Flip Register 51 */
#define MTU_MC71_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C6u)

/** \brief 47C8, Read Data and Bit Flip Register 52 */
#define MTU_MC71_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657C8u)

/** \brief 47CA, Read Data and Bit Flip Register 53 */
#define MTU_MC71_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00657CAu)

