Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 4CA4, Read Data and Bit Flip Register 34 */
#define MTU_MC76_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CA4u)

/** \brief 4CA6, Read Data and Bit Flip Register 35 */
#define MTU_MC76_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CA6u)

/** \brief 4CA8, Read Data and Bit Flip Register 36 */
#define MTU_MC76_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CA8u)

/** \brief 4CAA, Read Data and Bit Flip Register 37 */
#define MTU_MC76_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CAAu)

/** \brief 4CAC, Read Data and Bit Flip Register 38 */
#define MTU_MC76_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CACu)

/** \brief 4CAE, Read Data and Bit Flip Register 39 */
#define MTU_MC76_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CAEu)

/** \brief 4CB0, Read Data and Bit Flip Register 40 */
#define MTU_MC76_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CB0u)

/** \brief 4CB2, Read Data and Bit Flip Register 41 */
#define MTU_MC76_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CB2u)

/** \brief 4CB4, Read Data and Bit Flip Register 42 */
#define MTU_MC76_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CB4u)

/** \brief 4CB6, Read Data and Bit Flip Register 43 */
#define MTU_MC76_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CB6u)

/** \brief 4CB8, Read Data and Bit Flip Register 44 */
#define MTU_MC76_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CB8u)

/** \brief 4CBA, Read Data and Bit Flip Register 45 */
#define MTU_MC76_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CBAu)

/** \brief 4CBC, Read Data and Bit Flip Register 46 */
#define MTU_MC76_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CBCu)

/** \brief 4CBE, Read Data and Bit Flip Register 47 */
#define MTU_MC76_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CBEu)

/** \brief 4CC0, Read Data and Bit Flip Register 48 */
#define MTU_MC76_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CC0u)

/** \brief 4CC2, Read Data and Bit Flip Register 49 */
#define MTU_MC76_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CC2u)

/** \brief 4CC4, Read Data and Bit Flip Register 50 */
#define MTU_MC76_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CC4u)

/** \brief 4CC6, Read Data and Bit Flip Register 51 */
#define MTU_MC76_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CC6u)

/** \brief 4CC8, Read Data and Bit Flip Register 52 */
#define MTU_MC76_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CC8u)

/** \brief 4CCA, Read Data and Bit Flip Register 53 */
#define MTU_MC76_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CCAu)

/** \brief 4CCC, Read Data and Bit Flip Register 54 */
#define MTU_MC76_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CCCu)

/** \brief 4CCE, Read Data and Bit Flip Register 55 */
#define MTU_MC76_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CCEu)

/** \brief 4CD0, Read Data and Bit Flip Register 56 */
#define MTU_MC76_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CD0u)

/** \brief 4CD2, Read Data and Bit Flip Register 57 */
#define MTU_MC76_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CD2u)

/** \brief 4CD4, Read Data and Bit Flip Register 58 */
#define MTU_MC76_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CD4u)

/** \brief 4CD6, Read Data and Bit Flip Register 59 */
#define MTU_MC76_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CD6u)

/** \brief 4CD8, Read Data and Bit Flip Register 60 */
#define MTU_MC76_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CD8u)

/** \brief 4CDA, Read Data and Bit Flip Register 61 */
#define MTU_MC76_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CDAu)

/** \brief 4CDC, Read Data and Bit Flip Register 62 */
#define MTU_MC76_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CDCu)

/** \brief 4CDE, Read Data and Bit Flip Register 63 */
#define MTU_MC76_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CDEu)

/** \brief 4CE0, Read Data and Bit Flip Register 64 */
#define MTU_MC76_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CE0u)

/** \brief 4CE2, Read Data and Bit Flip Register 65 */
#define MTU_MC76_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CE2u)

/** \brief 4CE4, Read Data and Bit Flip Register 66 */
#define MTU_MC76_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065CE4u)

/** \brief 4CEE, Alarm Sources Configuration Register */
#define MTU_MC76_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0065CEEu)

/** \brief 4CF0, SSH Safety Faults Status Register  */
#define MTU_MC76_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0065CF0u)

/** \brief 4CF2, Error Information Register 0 */
#define MTU_MC76_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065CF2u)

/** \brief 4CF4, Error Information Register 1 */
#define MTU_MC76_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065CF4u)

/** \brief 4CF6, Error Information Register 2 */
#define MTU_MC76_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065CF6u)

/** \brief 4CF8, Error Information Register 3 */
#define MTU_MC76_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065CF8u)

/** \brief 4CFA, Error Information Register 4 */
#define MTU_MC76_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065CFAu)

/** \brief 4D00, Configuration Registers */
#define MTU_MC77_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065D00u)

/** \brief 4D02, Configuration Register 1 */
#define MTU_MC77_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065D02u)

