Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 4EA6, Read Data and Bit Flip Register 35 */
#define MTU_MC78_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EA6u)

/** \brief 4EA8, Read Data and Bit Flip Register 36 */
#define MTU_MC78_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EA8u)

/** \brief 4EAA, Read Data and Bit Flip Register 37 */
#define MTU_MC78_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EAAu)

/** \brief 4EAC, Read Data and Bit Flip Register 38 */
#define MTU_MC78_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EACu)

/** \brief 4EAE, Read Data and Bit Flip Register 39 */
#define MTU_MC78_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EAEu)

/** \brief 4EB0, Read Data and Bit Flip Register 40 */
#define MTU_MC78_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB0u)

/** \brief 4EB2, Read Data and Bit Flip Register 41 */
#define MTU_MC78_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB2u)

/** \brief 4EB4, Read Data and Bit Flip Register 42 */
#define MTU_MC78_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB4u)

/** \brief 4EB6, Read Data and Bit Flip Register 43 */
#define MTU_MC78_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB6u)

/** \brief 4EB8, Read Data and Bit Flip Register 44 */
#define MTU_MC78_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EB8u)

/** \brief 4EBA, Read Data and Bit Flip Register 45 */
#define MTU_MC78_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EBAu)

/** \brief 4EBC, Read Data and Bit Flip Register 46 */
#define MTU_MC78_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EBCu)

/** \brief 4EBE, Read Data and Bit Flip Register 47 */
#define MTU_MC78_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EBEu)

/** \brief 4EC0, Read Data and Bit Flip Register 48 */
#define MTU_MC78_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC0u)

/** \brief 4EC2, Read Data and Bit Flip Register 49 */
#define MTU_MC78_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC2u)

/** \brief 4EC4, Read Data and Bit Flip Register 50 */
#define MTU_MC78_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC4u)

/** \brief 4EC6, Read Data and Bit Flip Register 51 */
#define MTU_MC78_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC6u)

/** \brief 4EC8, Read Data and Bit Flip Register 52 */
#define MTU_MC78_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EC8u)

/** \brief 4ECA, Read Data and Bit Flip Register 53 */
#define MTU_MC78_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ECAu)

/** \brief 4ECC, Read Data and Bit Flip Register 54 */
#define MTU_MC78_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ECCu)

/** \brief 4ECE, Read Data and Bit Flip Register 55 */
#define MTU_MC78_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ECEu)

/** \brief 4ED0, Read Data and Bit Flip Register 56 */
#define MTU_MC78_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED0u)

/** \brief 4ED2, Read Data and Bit Flip Register 57 */
#define MTU_MC78_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED2u)

/** \brief 4ED4, Read Data and Bit Flip Register 58 */
#define MTU_MC78_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED4u)

/** \brief 4ED6, Read Data and Bit Flip Register 59 */
#define MTU_MC78_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED6u)

/** \brief 4ED8, Read Data and Bit Flip Register 60 */
#define MTU_MC78_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ED8u)

/** \brief 4EDA, Read Data and Bit Flip Register 61 */
#define MTU_MC78_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EDAu)

/** \brief 4EDC, Read Data and Bit Flip Register 62 */
#define MTU_MC78_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EDCu)

/** \brief 4EDE, Read Data and Bit Flip Register 63 */
#define MTU_MC78_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EDEu)

/** \brief 4EE0, Read Data and Bit Flip Register 64 */
#define MTU_MC78_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EE0u)

/** \brief 4EE2, Read Data and Bit Flip Register 65 */
#define MTU_MC78_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EE2u)

/** \brief 4EE4, Read Data and Bit Flip Register 66 */
#define MTU_MC78_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EE4u)

/** \brief 4EEE, Alarm Sources Configuration Register */
#define MTU_MC78_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0065EEEu)

/** \brief 4EF0, SSH Safety Faults Status Register  */
#define MTU_MC78_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0065EF0u)

/** \brief 4EF2, Error Information Register 0 */
#define MTU_MC78_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF2u)

/** \brief 4EF4, Error Information Register 1 */
#define MTU_MC78_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF4u)

/** \brief 4EF6, Error Information Register 2 */
#define MTU_MC78_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF6u)

/** \brief 4EF8, Error Information Register 3 */
#define MTU_MC78_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EF8u)

/** \brief 4EFA, Error Information Register 4 */
#define MTU_MC78_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065EFAu)

/** \brief 4F00, Configuration Registers */
#define MTU_MC79_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065F00u)

/** \brief 4F02, Configuration Register 1 */
#define MTU_MC79_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065F02u)

