Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 5110, Memory ECC Detection Register */
#define MTU_MC81_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066110u)

/** \brief 5112, Error Tracking Register 0 */
#define MTU_MC81_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066112u)

/** \brief 5114, Error Tracking Register 1 */
#define MTU_MC81_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066114u)

/** \brief 5116, Error Tracking Register 2 */
#define MTU_MC81_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066116u)

/** \brief 5118, Error Tracking Register 3 */
#define MTU_MC81_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066118u)

/** \brief 511A, Error Tracking Register 4 */
#define MTU_MC81_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006611Au)

/** \brief 5160, Read Data and Bit Flip Register 0 */
#define MTU_MC81_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066160u)

/** \brief 5162, Read Data and Bit Flip Register 1 */
#define MTU_MC81_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066162u)

/** \brief 5164, Read Data and Bit Flip Register 2 */
#define MTU_MC81_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066164u)

/** \brief 5166, Read Data and Bit Flip Register 3 */
#define MTU_MC81_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066166u)

/** \brief 5168, Read Data and Bit Flip Register 4 */
#define MTU_MC81_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066168u)

/** \brief 516A, Read Data and Bit Flip Register 5 */
#define MTU_MC81_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006616Au)

/** \brief 516C, Read Data and Bit Flip Register 6 */
#define MTU_MC81_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006616Cu)

/** \brief 516E, Read Data and Bit Flip Register 7 */
#define MTU_MC81_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006616Eu)

/** \brief 5170, Read Data and Bit Flip Register 8 */
#define MTU_MC81_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066170u)

/** \brief 5172, Read Data and Bit Flip Register 9 */
#define MTU_MC81_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066172u)

/** \brief 5174, Read Data and Bit Flip Register 10 */
#define MTU_MC81_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066174u)

/** \brief 5176, Read Data and Bit Flip Register 11 */
#define MTU_MC81_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066176u)

/** \brief 5178, Read Data and Bit Flip Register 12 */
#define MTU_MC81_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066178u)

/** \brief 517A, Read Data and Bit Flip Register 13 */
#define MTU_MC81_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006617Au)

/** \brief 517C, Read Data and Bit Flip Register 14 */
#define MTU_MC81_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006617Cu)

/** \brief 517E, Read Data and Bit Flip Register 15 */
#define MTU_MC81_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006617Eu)

/** \brief 5180, Read Data and Bit Flip Register 16 */
#define MTU_MC81_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066180u)

/** \brief 5182, Read Data and Bit Flip Register 17 */
#define MTU_MC81_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066182u)

/** \brief 5184, Read Data and Bit Flip Register 18 */
#define MTU_MC81_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066184u)

/** \brief 5186, Read Data and Bit Flip Register 19 */
#define MTU_MC81_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066186u)

/** \brief 5188, Read Data and Bit Flip Register 20 */
#define MTU_MC81_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066188u)

/** \brief 518A, Read Data and Bit Flip Register 21 */
#define MTU_MC81_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006618Au)

/** \brief 518C, Read Data and Bit Flip Register 22 */
#define MTU_MC81_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006618Cu)

/** \brief 518E, Read Data and Bit Flip Register 23 */
#define MTU_MC81_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006618Eu)

/** \brief 5190, Read Data and Bit Flip Register 24 */
#define MTU_MC81_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066190u)

/** \brief 5192, Read Data and Bit Flip Register 25 */
#define MTU_MC81_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066192u)

/** \brief 5194, Read Data and Bit Flip Register 26 */
#define MTU_MC81_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066194u)

/** \brief 5196, Read Data and Bit Flip Register 27 */
#define MTU_MC81_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066196u)

/** \brief 5198, Read Data and Bit Flip Register 28 */
#define MTU_MC81_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066198u)

/** \brief 519A, Read Data and Bit Flip Register 29 */
#define MTU_MC81_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006619Au)

/** \brief 519C, Read Data and Bit Flip Register 30 */
#define MTU_MC81_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006619Cu)

/** \brief 519E, Read Data and Bit Flip Register 31 */
#define MTU_MC81_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006619Eu)

/** \brief 51A0, Read Data and Bit Flip Register 32 */
#define MTU_MC81_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A0u)

/** \brief 51A2, Read Data and Bit Flip Register 33 */
#define MTU_MC81_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A2u)

/** \brief 51A4, Read Data and Bit Flip Register 34 */
#define MTU_MC81_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A4u)

/** \brief 51A6, Read Data and Bit Flip Register 35 */
#define MTU_MC81_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A6u)

/** \brief 51A8, Read Data and Bit Flip Register 36 */
#define MTU_MC81_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661A8u)

/** \brief 51AA, Read Data and Bit Flip Register 37 */
#define MTU_MC81_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661AAu)

/** \brief 51AC, Read Data and Bit Flip Register 38 */
#define MTU_MC81_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661ACu)

/** \brief 51AE, Read Data and Bit Flip Register 39 */
#define MTU_MC81_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661AEu)

/** \brief 51B0, Read Data and Bit Flip Register 40 */
#define MTU_MC81_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B0u)

