Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/GHS_Test/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_reg.h
/** \brief 59A0, Read Data and Bit Flip Register 32 */
#define MTU_MC89_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A0u)

/** \brief 59A2, Read Data and Bit Flip Register 33 */
#define MTU_MC89_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A2u)

/** \brief 59A4, Read Data and Bit Flip Register 34 */
#define MTU_MC89_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A4u)

/** \brief 59A6, Read Data and Bit Flip Register 35 */
#define MTU_MC89_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A6u)

/** \brief 59A8, Read Data and Bit Flip Register 36 */
#define MTU_MC89_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669A8u)

/** \brief 59AA, Read Data and Bit Flip Register 37 */
#define MTU_MC89_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669AAu)

/** \brief 59AC, Read Data and Bit Flip Register 38 */
#define MTU_MC89_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669ACu)

/** \brief 59AE, Read Data and Bit Flip Register 39 */
#define MTU_MC89_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669AEu)

/** \brief 59B0, Read Data and Bit Flip Register 40 */
#define MTU_MC89_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B0u)

/** \brief 59B2, Read Data and Bit Flip Register 41 */
#define MTU_MC89_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B2u)

/** \brief 59B4, Read Data and Bit Flip Register 42 */
#define MTU_MC89_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B4u)

/** \brief 59B6, Read Data and Bit Flip Register 43 */
#define MTU_MC89_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B6u)

/** \brief 59B8, Read Data and Bit Flip Register 44 */
#define MTU_MC89_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669B8u)

/** \brief 59BA, Read Data and Bit Flip Register 45 */
#define MTU_MC89_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669BAu)

/** \brief 59BC, Read Data and Bit Flip Register 46 */
#define MTU_MC89_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669BCu)

/** \brief 59BE, Read Data and Bit Flip Register 47 */
#define MTU_MC89_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669BEu)

/** \brief 59C0, Read Data and Bit Flip Register 48 */
#define MTU_MC89_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C0u)

/** \brief 59C2, Read Data and Bit Flip Register 49 */
#define MTU_MC89_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C2u)

/** \brief 59C4, Read Data and Bit Flip Register 50 */
#define MTU_MC89_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C4u)

/** \brief 59C6, Read Data and Bit Flip Register 51 */
#define MTU_MC89_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C6u)

/** \brief 59C8, Read Data and Bit Flip Register 52 */
#define MTU_MC89_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669C8u)

/** \brief 59CA, Read Data and Bit Flip Register 53 */
#define MTU_MC89_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669CAu)

/** \brief 59CC, Read Data and Bit Flip Register 54 */
#define MTU_MC89_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669CCu)

/** \brief 59CE, Read Data and Bit Flip Register 55 */
#define MTU_MC89_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669CEu)

/** \brief 59D0, Read Data and Bit Flip Register 56 */
#define MTU_MC89_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D0u)

/** \brief 59D2, Read Data and Bit Flip Register 57 */
#define MTU_MC89_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D2u)

/** \brief 59D4, Read Data and Bit Flip Register 58 */
#define MTU_MC89_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D4u)

/** \brief 59D6, Read Data and Bit Flip Register 59 */
#define MTU_MC89_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D6u)

/** \brief 59D8, Read Data and Bit Flip Register 60 */
#define MTU_MC89_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669D8u)

/** \brief 59DA, Read Data and Bit Flip Register 61 */
#define MTU_MC89_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669DAu)

/** \brief 59DC, Read Data and Bit Flip Register 62 */
#define MTU_MC89_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669DCu)

/** \brief 59DE, Read Data and Bit Flip Register 63 */
#define MTU_MC89_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669DEu)

/** \brief 59E0, Read Data and Bit Flip Register 64 */
#define MTU_MC89_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669E0u)

/** \brief 59E2, Read Data and Bit Flip Register 65 */
#define MTU_MC89_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669E2u)

/** \brief 59E4, Read Data and Bit Flip Register 66 */
#define MTU_MC89_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00669E4u)

/** \brief 59EE, Alarm Sources Configuration Register */
#define MTU_MC89_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00669EEu)

/** \brief 59F0, SSH Safety Faults Status Register  */
#define MTU_MC89_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00669F0u)

/** \brief 59F2, Error Information Register 0 */
#define MTU_MC89_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F2u)

/** \brief 59F4, Error Information Register 1 */
#define MTU_MC89_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F4u)

/** \brief 59F6, Error Information Register 2 */
#define MTU_MC89_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F6u)

/** \brief 59F8, Error Information Register 3 */
#define MTU_MC89_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669F8u)

